* Planning
** Introduction
A Clojure experiment in a planning system
*** Code               
#+name: set-clojure-session-var-s1
#+begin_src clojure :session s1 :results value :tangle yes
(def *var* [1 2 3])
#+end_src

#+results: set-clojure-session-var-s1
| function | user/*var* |

#+name: set-clojure-session-var-s2
#+begin_src clojure :session s2 :results value
(def *var* [3 4 5 6 7 8 9])
#+end_src

#+results: set-clojure-session-var-s2
| function | user/*var* |

#+name: get-clojure-session-var-s1
#+begin_src clojure :session s1 :results value
(count *var*)
#+end_src

#+results: get-clojure-session-var-s1
: 7

#+name: get-clojure-session-var-s2
#+begin_src clojure :session s2 :results value
(count *var*)
#+end_src

#+results: get-clojure-session-var-s2
: 3

